<template>
  <div class="agreement">
      <div class="text">
          <h3>【特别提示】</h3>
          <p>学生综合实践平台（以下简称“平台”）的所有权和运营权归海南九春教育科技股份有限公司所有。用户在申请注册流程中点击同意本协议之前，应当认真阅读本协议。请用户务必审慎阅读、充分理解各条款内容，特别是免除或者限制责任的条款、法律适用和争议解决与加粗字体部分的条款。如用户对协议有任何疑问，可向平台客服咨询确定后注册。</p>
          <h3>第一条 总则</h3>
          <p>1.在此特别提醒用户，在注册之前，用户仔细阅读并同意遵守本协议后方可成为注册用户。一旦注册成功，则用户与平台之间自动形成协议关系，用户的登录、使用等行为将视为对本协议的接受，并同意接受本协议各项条款的约束。</p>
          <p>2.由于互联网高速发展，用户与平台签署的本协议列明的条款并不能完整罗列并覆盖用户与平台的所有权利与义务，现有的约定也不能保证完全符合未来发展的需求。因此，本协议可由平台运营方随时更新，更新后的协议条款一旦公布即代替原来的协议条款，恕不再另行通知，用户可在平台中查阅最新版协议。如用户继续使用平台提供的服务将被视为接受修改后的协议。</p>
          <h3>第二条 协议双方</h3>
          <p>1.本协议由平台运营者与用户签订，对双方均具有合同效力。</p>
          <p>2.根据公司的业务或战略调整，平台运营者可能发生变更，注册会员可在平台公布的信息或平台底部查看，平台运营主体的变更不影响用户本协议项下的权利义务。</p>
          <h3>第三条 平台服务内容</h3>
          <p>1.平台主要提供围绕K12阶段孩子素质教育相关的主题实践活动，具体活动内容由平台根据实际情况提供，包括但不限于：</p>
          <p>①　考察探究类活动</p>
          <p>②　社会服务类活动</p>
          <p>③　设计制作类活动</p>
          <p>④　职业体验类活动</p>
          <p>2.平台不定时发布有关K12阶段素质教育相关的文章及政策。</p>
          <p>3.平台随时审核或删除用户发布/传播的涉嫌违法或违反社会主义精神文明或者平台认为不妥当的内容（包括但不限于文字、语音、图片、视频、图文等）。 </p>
          <h3>第四条 平台用户账号</h3>
          <p>1．平台以手机号作为账号，经平台注册系统完成注册流程并通过身份认证的用户即成为正式用户。平台可以根据用户需求或产品需要对账号注册方式进行变更，而无须事先通知用户。</p>
          <p>2．在用户注册及使用平台服务时，平台需要搜集能识别用户身份的个人信息以便平台可以在必要时联系用户或为用户提供更好的使用体验。平台搜集的信息包括但不限于用户的姓名、地址、联系方式等；平台同意对这些信息的使用将受限于第五条用户个人隐私信息保护的约束。</p>
          <p>3．用户一旦注册成功，将得到一个用户名和密码，用户有权利使用自己的用户名及密码随时登录平台；用户也可使用短信验证码的形式登录。用户有义务保证帐号和密码的安全，用户利用该帐号和密码所进行的一切活动引起的任何损失或损害，由用户自行承担全部责任，平台不承担任何责任。如用户发现帐号遭到未授权的使用或发生其他任何安全问题，应立即修改帐号密码并妥善保管，如有必要，请及时和平台客服人员取得联系，用户理解任何请求采取行动的行为均需要合理时间，且平台应用户请求而采取的行动可能无法避免或阻止侵害后果的形成或扩大，除平台存在法定过错外，平台不承担责任。</p>
          <h3>第五条 用户声明与保证</h3>
          <p>1．用户承诺其为具有完全民事行为能力的民事主体，且具有达成交易履行其义务的能力。</p>
          <p>2．用户有义务在注册时提供自己的真实资料，并保证诸如手机号码、姓名、所在地区等内容的有效性及安全性，保证平台工作人员可以通过上述联系方式与用户取得联系。同时，用户也有义务在相关资料实际变更时及时更新有关注册资料。</p>
          <p>3．用户对其自行发表、上传或传送的内容负全部责任，所有用户不得在平台任何页面发布、转载、传送含有下列内容之一的信息，否则平台有权自行处理并不通知用户：</p>
          <p>①　反对宪法所确定的基本原则的；</p>
          <p>②　危害国家安全，泄露国家秘密，颠覆国家政权，破坏国家统一的；</p>
          <p>③　损害国家荣誉和利益的；</p>
          <p>④　煽动民族仇恨、民族歧视，破坏民族团结的；</p>
          <p>⑤　破坏国家宗教政策，宣扬邪教和封建迷信的；</p>
          <p>⑥　散布谣言，扰乱社会秩序，破坏社会稳定的；</p>
          <p>⑦　散布淫秽、色情、赌博、暴力、凶杀、恐怖信息或者教唆犯罪的；</p>
          <p>⑧　侮辱或者诽谤他人，侵害他人合法权益的；</p>
          <p>⑨　煽动非法集会、结社、游行、示威、聚众扰乱社会秩序的； </p>
          <p>⑩　含有法律、行政法规禁止的其他内容的；</p>
          <p>4．用户不得在平台上制作、上传、发布、传播下列干扰平台正常运营，以及侵犯其他用户或第三方合法权益的内容，否则平台有权自行处理并不通知用户：</p>
          <p>①　含有任何性或性暗示的；</p>
          <p>②　含有辱骂、恐吓、威胁内容的；</p>
          <p>③　含有骚扰、垃圾广告、恶意信息、诱骗信息的；</p>
          <p>④　涉及他人隐私、个人信息或资料的；</p>
          <p>⑤　侵害他人名誉权、肖像权、知识产权、商业秘密等合法权利的；</p>
          <p>⑥　含有其他干扰平台正常运营和侵犯其他用户或第三方合法权益内容的信息。</p>
          <h3>第六条 隐私保护</h3>
          <p>1．平台不对外公开或向第三方提供单个用户的注册资料、平台自动接收并记录的用户浏览器上的服务器数值，包括但不限于IP地址等数据以及用户的其他行为数据。但下列情况除外：</p>
          <p>①　事先获得用户的明确授权； </p>
          <p>②　根据有关的法律法规要求；</p>
          <p>③　按照相关政府主管部门的要求；</p>
          <p>④　为维护社会公众的利益。</p>
          <p>2．我们的某些服务将由我们和授权合作伙伴共同提供。我们可能会与合作伙伴共享用户的某些个人信息，以提供更好的客户服务和用户体验。在此情况下，如该第三方同意承担与本平台同等的保护用户隐私的责任，则本平台有权将用户的注册资料等提供给该第三方。</p>
          <p>3．平台不允许任何第三方以任何手段收集、编辑、出售或者无偿传播用户的个人信息。任意平台用户如从事上述活动，一经发现，平台有权立即终止与该用户的服务协议，查封其账号，并追究相应责任。</p>
          <p>4．在不透露单个用户隐私资料的前提下，本平台在对用户信息去标志化处理后有权对整个用户数据库进行分析并对用户数据库进行商业上的利用。</p>
          <h3>第七条 责任声明</h3>
          <p>1．用户参加平台发布提供的活动，因第三方服务的质量缺陷及其他因素引发的任何矛盾，用户可直接要求第三方服务机构承担责任，平台无需承担任何责任。</p>
          <p>2．用户明确同意其使用本平台所存在的风险将完全由其自己承担，因其使用平台而产生的一切后果也由其自己承担。</p>
          <p>3．用户同意保障和维护平台及其他用户的利益，由于用户在平台操作中有违法、不真实、不正当、侵犯第三方合法权益的行为，或用户违反本协议项下的任何条款而给平台及任何其他第三方造成损失，用户同意承担由此造成的损害赔偿责任。</p>
          <p>4．鉴于网络服务的特殊性，用户需同意本平台会变更、中断部分或全部的网络服务，并删除（不再保存）用户在使用过程中提交的任何资料，而无需通知用户，也无需对任何用户或任何第三方承担任何责任。</p>
          <p>5．本平台需要定期或不定期地对提供网络服务的平台进行检测或者更新，如因此类情况而造成网络服务在合理时间内的中断，平台无需为此承担任何责任。</p>
          <h3>第八条 版权声明</h3>
          <p>1．本平台所发布的除活动之外的文章、内含的文字、图片、音频、视频等版权均归海南九春教育科技股份有限公司享有或与作者共同享有，未经本平台许可，不得任意转载。 </p>
          <p>2．本站特有的标识、版面设计、编排方式等版权均属海南九春教育科技股份有限公司享有，未经本平台许可，不得任意复制或转载。</p>
          <p>3．使用本平台的文章（除活动之外）均应注明“来源于学生综合实践平台”及署上作者姓名，按法律规定需要支付稿酬的，应当通知本平台商谈具体合作并支付稿酬，独立承担一切法律责任。</p>
          <h3>第九条 附则</h3>
          <p>1．本协议的订立、解释、履行和争议的解决等均适用中华人民共和国法律。因本协议引起或本协议有关的任何争议应由双方通过友好协商解决。如经协商后仍不能达成一致时，任何一方均有权向平台运营方所在地有管辖权的人民法院提起诉讼。</p>
          <p>2．如本协议中的任何条款无论因何种原因完全或部分无效或不具有执行力，本协议的其余条款仍应有效并且有约束力。</p>
          <p>3．本协议最终解释权归海南九春科技股份有限公司所有，并且保留一切解释和修改的权力。</p>
          <p>4．本协议从2017年12月10日起适用。</p>
      </div>
      <div class="btn" @click="read">我已阅读</div>
  </div>
</template>

<script>
import {
  apiUrl,
  GetRequest,
  getCookie,
  analyze,
  getItem,
  setItem,
  destroy
} from "../../common/js/common";
export default {
    data(){
        return{
            readAgreement:false
        }
    },
    created(){
        document.title = "用户注册协议";
        analyze()
    },
    methods:{
        read(){
            setItem('readAgreement',true)
            this.$router.push('/bindMobile')
        }
    },
    destroyed(){
        destroy()
    }
}
</script>

<style lang="stylus" scoped>
@import '../../common/stylus/variable.styl'
.agreement{
    line-height 0
    padding 0.3rem 0.2rem 0.3rem 0.2rem
    background-color #fff
    .text{
        h3{
            margin 0.2rem 0 0.2rem 0
            fs(13)
            color #333
            line-height 0.26rem
        }
        p{
            fs(12)
            color #999
            line-height 0.40rem
            text-indent 2em
        }
    }
    .btn{
        margin-top 0.5rem
        width 100%
        height 0.8rem
        line-height 0.8rem
        background-color #00bc71
        border-radius: 0.1rem
        fs(14);
        font-weight: 600
        color #fff
        text-align center
    }
}
</style>

